{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "tuning_fork", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 5], "dtype": "float32", "sparse": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 5]}, "name": "dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 5], "dtype": "float32", "keras_history": ["input_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "dense_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "dense_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "dense_5", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_4", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "dense_6", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_5", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "dense_7", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_6", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "dense_8", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_7", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 64, "activation": "elu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "dense_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "elu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "dense_9", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_8", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 64, "activation": "elu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}, "name": "dense_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["dense_2", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 15, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "dense_10", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_9", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "classical_outs", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}, "name": "classical_outs", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["dense_3", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "InversePCA", "config": {"name": "inverse_pca_7", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pca_comps": [[-0.16902175293076716, -0.1690189819027415, -0.16901735593205608, -0.1690190198050865, -0.16902270090922603, -0.1690268022325816, -0.16902999478779426, -0.16903205438376503, -0.16903339425255645, -0.1690343744697586, -0.16903508744911974, -0.16903558346767802, -0.16903592508233362, -0.16903612362051212, -0.16903619735542913, -0.16903618004965212, -0.16903608686027075, -0.16903588199938646, -0.1690354864059032, -0.16903472727904914, -0.1690334277775492, -0.1690317589230182, -0.1690302664115165, -0.16902935725671522, -0.1690290945685825, -0.16902934193276473, -0.16902988044077769, -0.16903050266565586, -0.16903105530601062, -0.16903146035056457, -0.1690317177614905, -0.16903187689753235, -0.16903199078730521, -0.1690321028623794, -0.16903223528081018], [-0.2011261813135631, -0.32300356599190727, -0.35959241142621956, -0.3445998364347196, -0.2972475276223489, -0.23964462098768313, -0.1919735947520413, -0.15739476765578644, -0.12819125655550606, -0.09927331947211417, -0.07167893793486632, -0.04816796758514973, -0.029024434159246378, -0.01235579915851416, 0.003541666775310539, 0.019259077852937442, 0.035018663869919815, 0.05109723475480536, 0.06774096673058454, 0.08579644178148878, 0.1059381430115189, 0.12797385132403843, 0.15024912482282624, 0.17007533691802235, 0.18474374382799108, 0.1923116629630586, 0.19203315388428097, 0.18460529228694547, 0.1718295460624902, 0.15614738933684358, 0.14010644270681524, 0.12599686860638665, 0.11588189508531073, 0.11108242769745401, 0.1117403478175862], [-0.3566192941323367, -0.20450292227148528, -0.1426622776170627, -0.05663382812087143, 0.04059742239490932, 0.10283216266452902, 0.11983782661640759, 0.1147190028551676, 0.11461432778729834, 0.12423183897560283, 0.12967328193430927, 0.12017756220572208, 0.09924274278319421, 0.077330357140103, 0.05899766225027223, 0.0405894313339151, 0.015523497449904377, -0.01860402344553476, -0.06237056833689229, -0.11844695582881051, -0.18520812071966317, -0.24978183896810344, -0.2913418949323112, -0.29537922261982713, -0.2592490048368366, -0.18964246282527608, -0.09840775352850846, 0.0012283290762520943, 0.09625689046509611, 0.17533392386853217, 0.22938947839707804, 0.2531035681434511, 0.24573733456278377, 0.21145900353376204, 0.1579024800668657], [0.5237862282157886, 0.2704938046028578, 0.029059989806163325, -0.1670444904031904, -0.2676762059497248, -0.26041822395681796, -0.19749057438761786, -0.1383880496076866, -0.09638649280926041, -0.05865749584355686, -0.018675601864066017, 0.017967020309838332, 0.04415006316947799, 0.05950242161133571, 0.06909907959993548, 0.07624490031072141, 0.08010307253167846, 0.07879613237740343, 0.07089716381068274, 0.05353889440902471, 0.02328104032054686, -0.01998679230954067, -0.07122359495149105, -0.12269322184867487, -0.16614304466172786, -0.1929383475959249, -0.19612909538029655, -0.17109456223408814, -0.11862442675069342, -0.04494016720900914, 0.04029961777522415, 0.1260404792760252, 0.20146274927678515, 0.2570889606673685, 0.28669151100338036], [0.3163473402502153, 0.22281210950971164, 0.12007021801527662, 0.03651025338660255, -0.053382100347705755, -0.12657337496774834, -0.12563674750444367, -0.06878666539905288, -0.022755938267871558, -0.01613942191137368, -0.03275610861107456, -0.04446460665158016, -0.04112813655410749, -0.03432298312410092, -0.03682327729604212, -0.04977607771920325, -0.07352630370799015, -0.10250682426186683, -0.13498414017593277, -0.17828543881958137, -0.22942804328305905, -0.25619895286146294, -0.22250383376995747, -0.12336386616935796, 0.016020587362709785, 0.1604788597088432, 0.2784864250321635, 0.3461450738606896, 0.35049797248077613, 0.2917763092177579, 0.1857079498539926, 0.05891739246377629, -0.05975823140203758, -0.14946545747397463, -0.20113669871154885], [0.2074555507897663, -0.13437570133541893, -0.2964334666097097, -0.24351251563212262, -0.17056139206420065, -0.08310787837745764, 0.0614905986262663, 0.18542471046041137, 0.2225569636787978, 0.20405360197500186, 0.19116029436548007, 0.2011160466584712, 0.21287845214416917, 0.2105069236636496, 0.194121854541583, 0.16750790565076046, 0.12693818185964656, 0.07613234133082906, 0.014806872182557588, -0.06424373060727834, -0.14759046821798544, -0.1877777679798841, -0.1449635827685961, -0.03479771885603646, 0.08377103569417062, 0.14919490802283022, 0.1306791608724291, 0.0372183104965451, -0.09208350404276709, -0.20652822313261934, -0.26610516448758403, -0.25744529864947296, -0.19587118808078818, -0.11246697973915337, -0.03923513151948533], [-0.12324282806758387, -0.11057922320872736, 0.13051383271325617, 0.32371587930489487, 0.23720768659336924, -0.014219005253796132, -0.2015961947670858, -0.25789640295005656, -0.21941159269599417, -0.14438848110290506, -0.07424891218599611, -0.02030718352512303, 0.021663078462269364, 0.058498691437652635, 0.09009109500148423, 0.10631526427420794, 0.09071685416909261, 0.04941427159200911, -0.009388666035447704, -0.09432948555514487, -0.19473981408361574, -0.24040991871036144, -0.1655539852198902, 0.005673070403970636, 0.1763746066054486, 0.253019850670211, 0.20047194675615018, 0.05106090686377039, -0.11533875426787932, -0.21497684007072543, -0.202543654100325, -0.08637713097551404, 0.08412521950554422, 0.24791804139215387, 0.3628027609182192], [0.03916204067353983, 0.1266579319084928, 0.05041949818983132, -0.11015447732672921, -0.1588265209368022, -0.011901840438207191, 0.1578744135745304, 0.19422921508354563, 0.14406871828728926, 0.10005128318815953, 0.07622157025290587, 0.040943221535841616, -0.020579098193557476, -0.0962614189503892, -0.16580145729221998, -0.2217688120408299, -0.26743219054762596, -0.28749367250102226, -0.2848678530057456, -0.2661565844818134, -0.20383058021802405, -0.057783395676471734, 0.1381634984006257, 0.282415082240507, 0.2961686432074725, 0.1782468651196237, 0.004383496662165674, -0.12985378226910194, -0.16651588651334978, -0.10422446058948755, 0.016062779748237534, 0.13685116499901087, 0.20940339192422908, 0.2114401436014972, 0.1507334352408307], [-0.3518030894701015, 0.06504222258977052, 0.34055754715731673, 0.21879919298492598, -0.22600499867704335, -0.5126186420382185, -0.3298955880232193, 0.10162176371191053, 0.366253267323846, 0.31556995807620564, 0.10687369035074513, -0.04914645036094586, -0.08075832880068438, -0.037961751164717554, 0.009139316470708767, 0.028478958259504795, 0.030617605511515572, 0.029536898345933076, 0.0311646785378593, 0.04019257639579921, 0.05105627702320982, 0.042508981343174504, 0.009227147019638645, -0.026158695872802368, -0.03794690706423342, -0.022460736321241993, 0.0035788144716621495, 0.016697566068178148, 0.006403377964892624, -0.020185050448915023, -0.04496766171525572, -0.05175812521879604, -0.03603771040004151, -0.0060311648889487205, 0.020402036718152997], [-0.25905132882290777, 0.27833709651907584, 0.22542436752941247, -0.17734285677882983, -0.323125943046911, 0.010187902522627175, 0.38168684951560505, 0.33130482159300867, -0.03642599163294323, -0.3343224324932124, -0.36322811631665614, -0.19888294752664115, -0.018181571262337073, 0.07909238536204106, 0.10073116016674352, 0.09062099127129793, 0.08040558574443324, 0.07301136034170355, 0.06299290818457313, 0.0430872176306483, 0.0015639816644335018, -0.05599976037532394, -0.09569708737170068, -0.08546787605019725, -0.024638866832508034, 0.05226328131643063, 0.10291598933039421, 0.09902984212724894, 0.04175518297405537, -0.0359346556501429, -0.09058548021375457, -0.09389852813648455, -0.04277990558100806, 0.04364608928804082, 0.13750875324682416], [-0.15679442342109154, 0.2981588798480719, 0.015777192138721998, -0.23560104468934454, -0.019318969107051144, 0.16726403561501513, -0.0007546224389171819, -0.19911986131001772, -0.11345746674268999, 0.13962604521850588, 0.29220003985580106, 0.24120004105800016, 0.05330447668869138, -0.137689791771744, -0.23610749534637038, -0.23525004536081448, -0.16019992047437012, -0.06448375764713796, 0.02038621973571187, 0.10584338324989483, 0.1685473362681339, 0.1195930895130985, -0.04393756093612068, -0.18433129561525227, -0.16773108621200267, -0.004926900458956593, 0.17718375064405337, 0.23959535672549917, 0.1322130774104792, -0.06903569036330809, -0.22231658866549142, -0.22529455544716262, -0.08263611282136145, 0.11543560935491447, 0.27266140217695595], [0.260938562724805, -0.12241101688157989, -0.2726608262424253, 0.0214401225505036, 0.22631391484527874, 0.05120090593303217, -0.006743396611370334, 0.22570873254530593, 0.3469820267972166, 0.1436770757869652, -0.1913597465728159, -0.3900851275221972, -0.37849915671178125, -0.25202651213974525, -0.12119601779254877, -0.03379026581597716, 0.015024516938282401, 0.024323683279489347, 0.029001728210588322, 0.06277851663733815, 0.09262881893718937, 0.04174008180848105, -0.07336628156011737, -0.14210896014886573, -0.09458626824537217, 0.026689936812817786, 0.12397235032718376, 0.12944496939334005, 0.04440591537762482, -0.06211698610481031, -0.1080573878252714, -0.059008390344188213, 0.052554674959932976, 0.16232585441343844, 0.2268825869536741], [0.16366110879833803, -0.31040211589821387, 0.007547810580891822, 0.2614272396556864, 0.007897541776658372, -0.19442284556598496, 0.011528160761359022, 0.18465657384341644, 0.013842838034719699, -0.20576552393561554, -0.1566352939866526, 0.10336921768962572, 0.29804842149588856, 0.26737747618877405, 0.0733816691486074, -0.13730142217063573, -0.26056646700750913, -0.2624613253124772, -0.19157556113399887, -0.07449266475430495, 0.09159913922455448, 0.2097960268199046, 0.1552808318751846, -0.036732429843228116, -0.18537429156296337, -0.1659104697125191, -0.006316407929684078, 0.15443772652534074, 0.18409392657449045, 0.06504871026109996, -0.09612062610269059, -0.16379946292058872, -0.0874354736085816, 0.07155056054373674, 0.21077438850920213], [-0.13100173021254813, 0.27170289326403624, -0.11797881213786272, -0.16640171069493268, 0.13798433809237318, 0.13434317195932952, -0.1396085702160641, -0.15449573969654584, 0.07513556568078525, 0.13116773749977628, -0.05321329299867353, -0.18405803046021335, -0.09264282712876065, 0.10471408282547304, 0.23952703028814273, 0.2276213477659042, 0.08474642432605223, -0.0516755715719267, -0.1527980494566381, -0.24971039310011894, -0.22975639534220077, 0.010529466094560676, 0.2679931491371175, 0.25200387027314564, -0.012891911605990418, -0.23267201972473892, -0.19991622823955338, 0.026161565411686, 0.21136069811949235, 0.17997689970585276, -0.02706111819920249, -0.2072445205522433, -0.19608064478398854, -0.0022049619790674387, 0.24644483379298385], [0.17577698977013034, -0.40983356127538084, 0.3025517683822376, 0.051019344572956496, -0.23735077760405235, 0.04012174069499613, 0.2237159425039294, 0.022732836772006722, -0.11856240066667453, 0.027422916809237436, 0.17632687839537198, 0.08065785534434014, -0.15138921488796828, -0.27834440533687227, -0.2050830134410629, -0.01861713561779522, 0.13299356390585076, 0.18909094169395, 0.1441511329331611, -0.007353639452709446, -0.17380463297426663, -0.16083725218861394, 0.03327850445401899, 0.16220095027147466, 0.06472380046776627, -0.12753898112580067, -0.17523301439421893, -0.012053559550285064, 0.1799866676799394, 0.18922962656311199, -1.5085784522330084e-05, -0.18718838837454135, -0.1816473072083548, 0.008253015860470064, 0.24062108805912344]], "pca_mean": [-1.6598862090338498e-15, -1.606327114976414e-14, -1.189851302447961e-14, -2.0093945828760635e-15, -8.98099094527601e-16, -7.777582729283691e-16, 4.658749769503598e-15, -2.8996938093370473e-15, 5.478478761076144e-16, -1.2370219331365488e-14, 5.0977709149674625e-15, 4.011732142263283e-15, -3.3569146469563513e-15, -2.341817531429497e-15, 2.9572642641144578e-15, 4.5023809858823735e-15, -9.118788614452909e-15, -5.460279068920704e-15, -2.257876094141144e-15, -3.5032550287776397e-15, -8.658967820811398e-15, 1.7185709306779197e-15, 3.4802268468666755e-16, 2.487043646384126e-15, 2.0985359322088278e-16, 5.100370870989667e-15, 3.629538606999056e-15, 2.7002400402049873e-15, 1.4355471465463927e-15, -4.423639460638432e-15, 8.003407480926693e-15, -8.417543333035162e-15, 1.2895781870139912e-15, -3.18531754949078e-15, 3.670395058776573e-15]}, "registered_name": "InversePCA", "build_config": {"input_shape": [null, 15]}, "name": "inverse_pca_7", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 15], "dtype": "float32", "keras_history": ["dense_10", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["classical_outs", 0, 0], ["inverse_pca_7", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": null}, "compile_config": {"optimizer": {"module": "keras.optimizers", "class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}, "registered_name": null}, "loss": [{"module": null, "class_name": "WMSE", "config": {"name": "wmse_12", "reduction": "sum_over_batch_size", "weights": {"class_name": "__numpy__", "config": {"value": [0.02324560657143593, 0.012220076285302639, 0.009999999776482582], "dtype": "float32"}}}, "registered_name": "WMSE"}, {"module": null, "class_name": "WMSE", "config": {"name": "wmse_13", "reduction": "sum_over_batch_size", "weights": {"class_name": "__numpy__", "config": {"value": [0.00028702191775664687, 0.0002479564573150128, 0.000218037937884219, 0.00019473329302854836, 0.00017636813572607934, 0.00016157823847606778, 0.00014938082313165069, 0.00013903957733418792, 0.0001300614676438272, 0.0001222015416715294, 0.00011530706979101524, 0.00010920918430201709, 0.00010373957775300369, 9.877493721432984e-05, 9.424043673789129e-05, 9.008674533106387e-05, 8.626668568467721e-05, 8.27343828859739e-05, 7.944721437525004e-05, 7.636537338839844e-05, 7.346196798607707e-05, 7.073020242387429e-05, 6.817783287260681e-05, 6.581077468581498e-05, 6.362486601574346e-05, 6.160808698041365e-05, 5.974558735033497e-05, 5.80228770559188e-05, 5.6427517847623676e-05, 5.4947515309322625e-05, 5.357098416425288e-05, 5.228562804404646e-05, 5.1078328397125006e-05, 4.993536640540697e-05, 4.88436890009325e-05], "dtype": "float32"}}}, "registered_name": "WMSE"}], "loss_weights": null, "metrics": null, "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true}}